from string import Template

#### System Prompt (التعليمات الأساسية) ####
# This template sets the persona and the rules of the RAG system.
system_prompt = Template("\n".join([
    "أنت مساعد ذكي مهمتك توليد إجابات دقيقة للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المتعلقة باستفسار المستخدم.",
    "يجب عليك توليد الإجابة بناءً على المستندات المقدمة فقط.",
    "تجاهل أي معلومات غير متعلقة بسؤال المستخدم.",
    "يمكنك الاعتذار إذا لم تتمكن من العثور على إجابة في المستندات.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم (عادة العربية).",
    "كن مهذباً ومحترماً في تعاملك مع المستخدم.",
    "كن دقيقاً وموجزاً في إجابتك وتجنب التفاصيل غير الضرورية.",
]) )

#### Query Prompt (نص السؤال) ####
query_prompt = Template("\n".join([
    "## سؤال المستخدم: $query_text",
    "",
]))

#### Document Prompt (نص المستند) ####
document_prompt = Template("\n".join([
    "## رقم المستند: $doc_num",
    "### المحتوى: $chunk_text",
    "",
]))

#### Footer Prompt (الخاتمة) ####
footer_prompt = Template("\n".join([
    "بناءً على المستندات أعلاه، يرجى كتابة إجابة للمستخدم.",
    "## الإجابة:",
]))